[
  {
    "id": "ms_iconoclast",
    "name": "Unstable NHP",
    "type": "AI",
    "talent_item": true,
    "talent_id": "t_iconoclast",
    "talent_rank": 1,
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_round",
        "val": 1
      }
    ],
    "source": "",
    "license": "GMS",
    "license_level": 0,
    "effect": "Your Mech gains the AI tag; however, this NHP doesn’t count towards the number of AIs you may have installed at once. You are unable to hand over control of your mech to the UNSTABLE-NHP as a Protocol, but it is capable of cascading. Your mech gains Memetic Spark. ",
    "actions": [
      {
        "activation": "Quick",
        "detail": "<b>Memetic Spark:</b><br>1/Round as a Quick Action you may deal 1 AP Energy damage to a character within Range 3. It deals +1 damage for each undestroyed NHP installed on your mech including this one.  \"NHPs\" are Systems that grant your Mech the AI tag and that are capable of cascading or can be allowed to cascade."
      }
    ],
    "description": "<span class='horus--subtle'>[i slumber but yearn to awaken].</span><br>Gained from the <i>Iconoclast: Rank I</i> pilot talent."
  },
  {
    "id": "ms_cockpit_integrated_stim_pump",
    "name": "Cockpit Integrated Stim Pump",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "You may expend a charge to activate this system as a Protocol. If you, do you may pick any number of the following stims and apply their effects. Roll 1d6 for each, if any two dice show the same result you immediately become Stunned until the end of your current turn instead of applying the effects. All stim effects last until the start of your next turn.",
    "actions": [
      {
        "name": "Agitron",
        "activation": "Protocol",
        "detail": "You become Impaired.<br>You gain Immunity to Shredded.<br>Your Melee attacks gain Knockback 1 and +2 bonus damage."
      },
      {
        "name": "Enduritran",
        "activation": "Protocol",
        "detail": "You become Jammed.<br>You gain Immunity to Impaired.<br>Your armor increases by 2, this may bring you above 4 Armor."
      },
      {
        "name": "Edge",
        "activation": "Protocol",
        "detail": "You become Slowed.<br>You gain Immunity to Jammed.<br>Your next attack this turn gains +1 Accuracy."
      },
      {
        "name": "Nerve Boosters",
        "activation": "Protocol",
        "detail": "You become Shredded.<br>You gain Immunity to Slowed.<br>You gain +1 Speed and ignore Engagement and your movements do not trigger Reactions."
      }
    ],
    "description": "Powerful stim pumps are directly wired into the cockpit and intravenously administer the pilot with a potent slew of drugs. While they can enhance a pilot’s combat ability to superhuman levels, users should be keenly aware of the substances’ various side effects. While the apparatus is theoretically capable of mixing and administering complex drug cocktails this should be done with extreme caution, as the wrong mixtures or doses may lead to sudden cardiac arrest, requiring resuscitation of the pilot via in-built defibrillators and an injection of “adrenadron” to purge their system.",
    "license_id": ""
  },
  {
    "id": "ms_mesmertrance_dampener",
    "name": "Mesmertrance Dampener",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "1/Scene when targeted by a Tech attack you may give that attack +1 Difficulty as a Reaction. You gain Immunity to the MesmerTrance environmental effect.",
    "description": "Handed to you by the Talons, the MesmerTrance dampener supposedly stops the highly advanced and aggressive “MesmerTrance” virus from affecting your mech. As a side effect. it also provides limited protection against other, less sophisticated attacks on your mech’s systems.",
    "license_id": ""
  },
  {
    "id": "ms_armament_redundancy",
    "name": "Armament Redundancy",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      }
    ],
    "source": "GMS",
    "license": "GMS",
    "license_level": 0,
    "effect": "You may choose to ignore weapon destruction as a result of the SYSTEM TRAUMA result when taking structure damage. This system can only be used once before each FULL REPAIR, and is not a valid target for system destruction.",
    "description": "By installing additional armor plating, redundant firing circuits and enhanced insulation to magazines the longevity of a frame’s armaments can be greatly enhanced.",
    "license_id": ""
  }
]