[
  {
    "id": "t_prospector",
    "name": "Prospector",
    "description": "Some people aren’t afraid to get their hands dirty. You are one of these individuals and you aren’t afraid to get your mech’s hands dirty, either. Having equipped it with all sorts of industrial mining equipment, your mech is now able to move great amounts of dirt in a very short amount of time, allowing it and its allies to rapidly redeploy using subterranean routes.",
    "ranks": [
      {
        "name": "Stake a Claim",
        "description": "Tunnel: When Tunneling, remove the character from the battlefield and then immediately place them in a free and valid space. This is considered moving 1 space and does trigger Reactions. <br>Gain the “Create Entrance” Quick Action which you may use 1/Scene. <br>While completely within an Entrance you and allied characters gain the “Subterranean Reposition” Reaction during your own turns.",
        "actions": [
          {
            "name": "Create Entrance",
            "activation": "Quick",
            "detail": "1/Scene While standing on solid ground you may create a Burst 1 Entrance around yourself as a Quick Action. You may then Tunnel to anywhere up to 5 spaces away where you then create another Burst 1 Entrance. Entrances remain in play until the end of the scene. Terrain and sections of terrain overlapping an Entrance take 20 AP Explosive damage. Additionally, you cannot take Reactions until the end of the current turn."
          },
          {
            "name": "Subterranean Reposition",
            "activation": "Reaction",
            "frequency": "1/round",
            "trigger": "During your turn, you are completely within an Entrance.",
            "detail": "You immediately Tunnel, ending the movement completely within a different Entrance created by the same character as the first."
          }
        ]
      },
      {
        "name": "Gold Fever",
        "description": "Hostile characters within the area when an Entrance is created must succeed on a Hull save or be knocked Prone. <br>Additionally, after you use “Create Entrance,” allied characters completely within your initial Entrance may use “Subterranean Reposition” even though it is not their turn."
      },
      {
        "name": "Mother Lode",
        "description": "“Create Entrance” becomes 1/Round and you may use it an additional time each Scene.  All Entrances you create are connected for the purposes of Tunneling."
      }
    ],
    "icon_url": "https://i.imgur.com/tkXq4rz.png"
  },
  {
    "id": "t_iconoclast",
    "name": "Iconoclast",
    "description": "You have acquired an NHP, or has it acquired you? Together you have set out to achieve greatness and push boundaries. The two of you are in it together and you’ll be able to achieve fantastical things. Perhaps you’re unaware of the risks; perhaps you willfully choose to ignore them. The power you can tap into with the help of your companion is, however, undeniable. And with such power, who is to stop the two of you from breaking some taboos?",
    "ranks": [
      {
        "name": "Transgression",
        "description": "You may choose to equip your mech with an Unstable NHP system.",
        "special_equipment": [
          "ms_iconoclast"
        ]
      },
      {
        "name": "Transmutation",
        "description": "After performing any action granted to you by an NHP, excluding handing control of your mech over to the NHP as a protocol, you may immediately perform the TRANSMUTING SPARK free action. Each NHP may only trigger this action 1/round.",
        "actions": [
          {
            "name": "Transmuting Spark",
            "activation": "Free",
            "detail": "Project a LINE 3 lightning arc as a free action. Characters of your choice in the LINE take 2 AP energy damage."
          }
        ]
      },
      {
        "name": "Transcension",
        "description": "Gain a Transcendence Die, a d3 starting at 3. When you use “Transmuting Spark,” reduce the die by 1. If the die is at 1 when you use “Transmuting Spark,” you may immediately enter a transcendent state and reset the Transcendence Die to 3. This has the following effects until the end of your next turn: <br><ul><li>Your Transcendence Die can’t decrease.</li><li>“Memetic Spark” gains +4 damage and +5 Range.</li><li>Unless flying or climbing, you are forced to permanently Hover exactly 1 Space above any surface at all times.</li><li>You gain Immunity to involuntary movement.</li></ul><br>Whenever you cascade and lose control of your mech, you enter a transcendent state for the duration. Cascading NHPs have access to the benefits of this Talent. Your Transcendence Die resets at the end of the Scene."
      }
    ],
    "icon_url": "https://i.imgur.com/R0vZWwL.png"
  },
  {
    "id": "t_field_analyst",
    "name": "Field Analyst",
    "description": "You’ve always been perceptive, able to analyze the flow of battle and come up with strategies on the spot. You’re the mastermind behind the scenes, helping your allies out in battle in various ways. From subtle nudges to your comrades when aiming their weapons to devising advanced firing solutions or tailor-made evasive patterns. With your support, any battle your allies find themselves in is sure to end in success.",
    "ranks": [
      {
        "name": "Tactical Intelligence",
        "description": "Whenever an allied character in line of sight misses with an attack, you know by how much it missed. Additionally, you gain the “Superior Intelligence” Reaction.",
        "actions": [
          {
            "name": "Superior Intelligence",
            "activation": "Reaction",
            "frequency": "2/round",
            "trigger": "An allied character in Line of Sight has rolled an Attack Roll.",
            "detail": "You may add 1 to the attack roll. This may cause an attack to hit or to critically hit. Each attack roll can only be affected this way once."
          }
        ]
      },
      {
        "name": "Information Handling",
        "description": "Gain an Intel Die, a d6 starting at 1. <br>At the end of your turn, if you didn’t take any actions that affected a hostile character during that turn other than Scan, your Intel Die increases by 2 to a maximum of 6. <br>Whenever you use Superior Intelligence, you may increase the attack roll by the value of your Intel Die instead of by 1. Afterward, it is reset to 1. <br> Your Intel Die resets at the end of each scene."
      },
      {
        "name": "Active Interference",
        "description": "Whenever a hostile character in line of sight hits with an attack, you know what they rolled. <br>You may also use “Superior Intelligence” when a hostile character in Line of Sight has rolled an Attack Roll. Instead of adding to the attack roll, you subtract from it in the same manner. Each attack roll can only be affected this way once."
      }
    ],
    "icon_url": "https://i.imgur.com/YMwpX9P.png"
  }
]