[
  {
    "id": "mf_störtebeker",
    "variant": "Raleigh",
    "license_id": "mf_raleigh",
    "license_level": 2,
    "source": "IPS-N",
    "name": "Störtebeker",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 42,
    "description": "Following the commercial failure of the Raleigh, several third parties found themselves with the opportunity of buying out development rights for the license as IPS-N sought to recoup initial costs. One of the companies that found itself in this position, Anton Industries, had fallen on hard times after its CEO vanished in mysterious circumstances, leading to plummeting stocks. <br>Chasing a lucky break and seizing the opportunity, Anton Industries began work on what would ultimately be the last frame ever to be developed under its name. Basing the modifications to the Raleigh on one of its own mechs – the Hades Mk3 – Anton Industries quickly developed the frame into a capable combined-arms platform emphasizing speed and rapid deployment. Instead of the Raleigh’s integrated Mjolnir, a weapon far too heavy for the new doctrinal approach, the modified chassis sports an internal reservoir of TRUESILVER nanites, a proprietary whitewash product capable of enhancing a weapon’s destructive power on a strike-to-strike basis. <br>The resulting mech was named “Störtebeker” after an old Cradle legend in a fit of gallows humor regarding the company’s less than ideal position. The frame, just like its namesake, ultimately spelled doom for the company, despite its relative success. <br>Quickly gaining popularity among mercenaries, black-ops units, and bounty hunters alike, the Störtebeker became the frame of choice for those requiring speed and maneuverability out of an IPS-N base but who preferred a solid ranged component over the Nelson’s dedicated close-combat focus. <br>IPS-N itself, interested in the Störtebeker, eventually decided to buy out the smaller company and, indifferent to Anton Industries’ other projects and subsidiaries, cannibalized the company in its entirety. Thus, the Störtebeker, now licensed fully as a Raleigh variant-frame under the IPS-N label, stands as a testament to a company’s destruction and how sometimes, one can do well and fail because of it.",
    "mounts": [
      "Flex",
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 10,
      "edef": 7,
      "heatcap": 5,
      "repcap": 5,
      "sensor_range": 8,
      "tech_attack": 0,
      "save": 10,
      "speed": 5,
      "sp": 5
    },
    "traits": [
      {
        "name": "Dynamic Reload",
        "description": "The Störtebeker’s non-Auxiliary weapons gain the following effects: <br><ul><li><b>Melee weapons</b> gain: “On critical hit: Reload all ranged weapons not used to attack this turn.”</li><li><b>Ranged weapons</b> gain: “On critical hit: Reload all melee weapons not used to attack this turn.”</li></ul>",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "Rifle",
              "Cannon",
              "Launcher",
              "CQB",
              "Nexus"
            ],
            "weapon_sizes": [
              "Main",
              "Heavy",
              "Superheavy"
            ],
            "detail": "On critical hit: Reload all melee weapons not used to attack this turn."
          },
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "Melee"
            ],
            "weapon_sizes": [
              "Main",
              "Heavy",
              "Superheavy"
            ],
            "detail": "On critical hit: Reload all ranged weapons not used to attack this turn."
          }
        ]
      },
      {
        "name": "Truesilver",
        "description": "1/Scene, after hitting with a weapon, the Störtebeker may apply one of the following effects depending on the weapon’s type. <br><ul><li><b>Non-Loading weapon:</b> The hit is treated as a Critical Hit. Resulting damage is not rolled twice.</li><li><b>Loading weapon:</b> Resulting damage can’t be reduced.</li></ul>",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "any"
            ],
            "weapon_sizes": [
              "any"
            ],
            "detail": "1/Scene, after hitting with a weapon, the Störtebeker may apply one of the following effects depending on the weapon’s type. <br><ul><li><b>Non-Loading weapon:</b> The hit is treated as a Critical Hit. Resulting damage is not rolled twice.</li><li><b>Loading weapon:</b> Resulting damage can’t be reduced.</li></ul>"
          }
        ]
      }
    ],
    "core_system": {
      "name": "Truesilver Weaponry",
      "description": "Project TRUESILVER was an attempt to improve the destructive capabilities of whitewash nano-machines. The hyper-specialized nanites manifest themselves as a mirror-sheen silver coating that can spread over ammunition and melee weapons alike. This coating gives armaments a striking appearance and is the source of the system’s unique name. Thus enhanced, weapons can deliver a destructive nanite payload that compounds any damage done by the initial strike exponentially, eating away at a target from the inside. <br>TRUESILVER nanites are internally printed and held in a specialized shielded reservoir before being fed to a mech’s weapons systems. Slow to be replenished by the frame’s internal printers, pilots must manage their use with care.",
      "active_name": "Truesilver Arsenal",
      "active_effect": "You may use your Truesilver trait three more times this Scene.",
      "activation": "Protocol",
      "passive_name": "Hopkins Doctrine",
      "passive_effect": "You may only take this action if you took the skirmish action this turn. Pick one of the following effects:",
      "passive_actions": [
        {
          "name": "Reprise",
          "activation": "Quick",
          "detail": "Skirmish with a weapon that was reloaded via DYNAMIC RELOAD this turn."
        },
        {
          "name": "Renewal",
          "activation": "Quick",
          "detail": "All weapons not used to attack this turn are reloaded at the end of the turn."
        }
      ],
      "use": "Encounter"
    },
    "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/Stortebeker.png"
  },
  {
    "id": "mf_micro_monarch",
    "variant": "Monarch",
    "license_id": "mf_monarch",
    "license_level": 2,
    "source": "SSC",
    "name": "Viceroy",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 11.5,
    "description": "An offshoot from SSC’s Bella Ciao line, the Viceroy is the result of rigorous field-testing in pursuit of a more accessible version of its larger sibling, the ever-ubiquitous Monarch. Originally developed under the moniker “MicroMonarch”, the scaled-down frame is nevertheless a force to be reckoned with and sports the high-quality engineering expected from all SSC mechs. Where the Monarch focuses on devastating long-range firepower, the Viceroy is more akin to a close-range brawler, using its sophisticated near-threat targeting arrays to wield the launchers of its sibling with deadly precision. <br>Equipped with a scaled-down version of the Monarch’s own SSC-30 High-Penetration Missile System, the Viceroy is more than capable of saturating an area around itself with relatively small but high-yield warheads, aimed with pinpoint accuracy. <br>This, coupled with an integrated, one-use burst jump pack, turns the Viceroy into a potent shock trooper with devastating first-strike capabilities. This role is supported by its ability to shrug off any potential self-inflicted harm from any “shock and awe” maneuvers thanks to its advanced blast-resistant armor plating. <br>Since its recent official release, the Viceroy has become – by SSC standards – an affordable frame that is now being widely rolled out to various SSC associates and subsidiaries. Slated to be approved for mass production, it is anticipated the Viceroy will become a frontline “soldier” mech to ultimately rival the likes of Harrison Armory’s Sherman.",
    "mounts": [
      "Aux/Aux",
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 8,
      "edef": 8,
      "heatcap": 6,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 11,
      "speed": 5,
      "sp": 5
    },
    "traits": [
      {
        "name": "Near-Threat Targeting Processor",
        "description": "The Viceroy treats its LAUNCHER weapons as though they are also CQB weapons with THREAT 3.",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "Launcher"
            ],
            "weapon_sizes": [
              "any"
            ],
            "detail": "This weapon is treated as though it were also a CQB weapon with THREAT 3."
          }
        ]
      },
      {
        "name": "Vigilante Omnidirectional Launchers",
        "description": "1/Round, on a critical hit against a character, the Viceroy may immediately deal 2 Explosive damage to all characters of its choice within Range 3 of itself and knock them back 1 space."
      },
      {
        "name": "Pressure Plating",
        "description": "The Viceroy has Resistance to Explosive Damage."
      }
    ],
    "core_system": {
      "name": "SSC-41 Tengu-Assisted Missile Tubes",
      "description": "By redlining its integrated Vigilante launchers, the Viceroy can deliver a devastating saturation bombardment of its close surroundings. Weathering the onslaught thanks to its blast-resistant exterior, the Viceroy can utilize this salvo, when coupled with the miniaturized Tengu one-burst jump system, for a variety of advanced battlefield tactics. This allows it to either deliver a near-unstoppable alpha strike or make a dramatic exit. “Heaven’s downpour” is a technique that strikes fear in any that face a Viceroy pilot in combat.",
      "active_name": "Heaven’s Downpour",
      "active_effect": "Center a Burst 3 missile swarm on yourself. Hostile characters in the area must succeed on a Hull save or take 1d6+3 Explosive damage and be knocked Prone. On a successful save they take half damage and remain standing. You may consume an affected character’s Lock On to make them automatically fail the save. <br>Before or after taking this action you may Fly up to your Speed, ignoring Engagement and Reactions. You must end this movement on solid ground or begin falling.",
      "use": "Encounter",
      "activation": "Quick"
    },
    "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/Viceroy.png"
  }
]
